
/*
===============================================================================================================================

Tree : به ساختمان داده ای برای نگه داری داده هایی که به صورت بالا به بایین هستش میگویند

Edge : به راه های ارتباطی بین نودها یا گره ها می میگویند

node : به هر یک از قسمت های درخت امون یا خونه هاش اصطلاحا یک نود یا گره میگوییم که مقادیر رو داخل اون قرار میدهیم

Root : شاخه اصلی درخت ما یا نودی که بعد از اون ساختار درختی ما مقدار دهی میشود یا اصطلاحا اولین نود امون

subTree : درخت زیرمجموعه

leaf : یک نود بدون زیر مجموعه

path : مسیر ارتباط بین نودها

Distance :  ها برای ارتباط دو نود Edge تعداد

Parent / Child : متصل به هم Node دو  

هستش Html در داخل کدهای DOM استفاده از Tree نکته : ساده ترین مدل استفاده از 

HTML : Root

   node  body 

       node div

جستجو در درخت ها به دو صورت 

Depth frist :  شروع میشه و به ترتیب  میاد و نودهارو از بالا به بایین بیمایش میکنه و میره بایینRoot از 
  
‌‌‌Breath - frist :  در این حالت همه نود هامون میان و بررسی می شوند و بعد از اون میاد و یک لول به بایین نودهامون میره

===============================================================================================================================
*/

