/*
=============================================================================================================

Tabel   و   List    مقایسه ساختمان داده 

List :   و برای پیمایش هم از حلقه استفاده میکنیم index مجموعه از مقادیر  هستند که برای دسترسی به اون ها از 

List Example : Sets  Array  LinkedList

Tabel :و عدم تمرکز روی حلقه ها  key دسترسی به داده ها از طریق  key  و value  مجموعه ای از 

Tabel Example : Maps Object

ساختمان داده مفهومی هستنش که میتونیم با استفاده از سینتکس های برنامه نویسی داخل اون ها بیایم و پیاده سازی بکنیم
برای نیاز های خاصی که داریم

Stack :  نوعی آرایه ساده هستش که فقط دوتا کار میشه با اون انجام داده اضافه کردن و حذف کردن اونم فقط از قسمت بالای لیست یا اصطلاحا
آخر لیست میاد و حذف میشه

ما زمانی که از استک استفاده میکنیم یک جور پریپند انجام میدیم که مقادیر فقط بالای آرایه امون اضافه یا حذف بشوند که تمرکز مارو می بره سمت پرفرومنس برنامه امون

=============================================================================================================
*/
