/*
------------------------------------------------------------------------------------------------------------------------------
==============================================================================================================================

یک از برکاربرد ترین انواع درخت ها هستش که از اون ها استفاده میکنیم برای نگه داری داده هایی که شرایط خاصی رو دارند
این نوع درخت دو تا شرط مهم داره اولی این که هر نود اون حداکثر دو تا نود زیر مجموعه میتونه داشته باشه و دومین شرط اون
هم اینه که نود سمت چب باید کوچک تر از نود سمت راست باشه و نود راستی باید بزرگ تر باشه 


==============================================================================================================================
------------------------------------------------------------------------------------------------------------------------------
*/