/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------
==============================================================================================================================================================

که داخل جاوااسکریبت هستند حالا ما خودمونmap  sets  array  object مثل ساختمان داده های built in ما یکسری ساختمان داده داریم که اصطلاحابه صورت
میخایم بیایم و یکسری ساختمان داده رو بسازیم و اصطلاحا ساختمان داده های کاستوم داشته باشیم

linked  List :  ها کار نمیکنیم و یک لیست هستش  index داخل این ساختمان داده ما میتونیم بیایم و مقادیر رو ذخیره سازی کنیم و در داخل اون دیگه با 
که خیلی شبیه به آرایه ها هستش و به جای ایندکس ما مقادیر داریم و هر مقداریک بوینتر داره که به مقدار بعدی خودش میاد و اشاره میکنه وقتی ما میخایم
بیایم و یک داده ای رو به اون اضافه کنیم همیشه میتونیم بیایم و از ابتدا یا انتها لیست امون این کار امون رو بکنیم

از لینکدین لیست ها بیشتر برای مدیریت حافظه  میتونیم بیایم و استفاده بکنیم در زبان جاوااسکریبت به کمک سایز های داینامیک برای آرایه ها میتونیم
به مدیریت حافظه رو انجام بدیم ولی درصورتی که بخایم بیایم و مقادیر زیادی رو به ابتدای آرایه امون اضافه کنیم بهتر هستش که از لینکد لیست ها استفاده
بکنیم

ما وقتی از لینکدین لیست ها استفاده میکنیم نیازی به تعیین طول لیست نداریم

جمع بندی

۱- المنت ها به خط بعدی اشاره میکنند  - 2 انتخاب منطقی تر برای ورد به داده ها

وقتی ما قراره بیایم و یک ساختمان داده کاستوم رو بنویسیم این ساختمان داده قرار نیستش که بیاد و یک فانکشن یا تابع باشه چون توابع میان و برای ما
یک فرایند رو طی میکنند بس باید بیایم و یک کلاس رو درست کنیم یک کلاس یا یک کانستراکتور 

بیچیدگی زمانی 

Linear Time :  برای رسیدن به عدد بزرگ تر بیمایش بیشتری انجام می شود در نتیجه نمودار خطی زمان  افزایش خواهد داشت

و از اون استفاده میکنیم تا بتونیم بیچیدگی زمانی یا اصطلاحا  Big O Notaion  بررسی این نمودار ها به کمک یک مفهوم هستش به نام

یک الگوریتم رو به دست بیاریم time complexting 

بیچیدگی های زمانی

O(n) : تا هستش  n تعداد متغیر هامون برای بررسی و رسیدن به جواب برابر با 

O(۱) : تعداد متغیرهامون ثابت هستش و بستگی به حجم داده هامون نداره

linked list          array  
   o(n)                o(1)             






==============================================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------
*/