/*
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
==================================================================================================================================

What’s Computer Science?   Basically , Computer science refers to an act of solving problems.
علم کامپیوتر چیست   ؟    اصولاً علم کامپیوتر به عملی برای حل مسائل اشاره دارد.

Problem Solveing : When we talk about computer science, We can think of problem-solving as the process of taking some input 
(details about our problem) and generate some output  (the solution to our problem).

ما میتونیم حل مسئله رو به عنوان فرآیند دریافت مقدار ورودی ( مسئله ای که میخاهیم حل کنیم ) و تولید برخی خروجی ها ( راه حل مشکل خود ) در نظر بگیرم

==================================================================================================================================

Representing numbers   انواع شمارنده ها 

1- unary : To count the number of people in a room, we might start by using our fingers, one at a time. This system is called unary
where each digit represents a single value of one
میگویند که  unary برای شمارش تعداد افراد درون یک اتاق ممکن است با استفاده از انگشتان خودمون یکی یکی شروع کنیم به شمارش  به این سیستم شمارش
هر رقم یک مقدار واحد را نشان میدهد

2- decimal : To count to higher numbers, we might use ten digits, 0 through 9, with a system called decimal
این کار رو انجام بدهیم decimal برای شمارش اعداد بالاتر ممکن است از ده رقم 0 تا 9 با سیستمی به نام اعشار 

3- binary :  Computers use a simpler system called binary, with just two digits, 0 and 1
کامپیوترها از سیستم ساده تری به نام باینری استفاده می کنند که فقط دو رقم 0 و 1 دارد.

Each binary digit is also called a bit   که به هر یک از این رقم ها یک بیت میگویند

به اضای هر 8 بیت یک بایت رو داریم

001  :   numbers 1  / 010 : numbers 2  /   011 : number 3 /   100 :  number 4 / 101: number 5 /  110 : number 6 /  111 : number 7

این مبنای 0 یا 1 بودن بر مبنای خاموش یا روشن بودن یک لامپ هستش که این لامپ ها با یک سوییچ میان و روشن و خاموش می شوند که در داخل کامپیوتر های مدرن
ملیارد ها سویچ کوچ داریم به نام ترانزیستور که با خاموش یا روشن کردن اون ها میشه مقادیر مختلفی رو نمایش داد همچنین برای این که یک عدد رو به مبنای دو ببریم باید 
اون رو تا جایی که میتونیم تقسم بر دو بکنم

25  ÷  2   = 12   =   %    1 
12  ÷  2   = 6     =   %    0
6    ÷   2   =  3    =  %    0 
3    ÷   2   =  1    =  %    1
1    ÷   2   =  0    =  %    1

10011  نتیجه نهایی

خوب حالا حالا باینری بالا رو هم بخایم به دسیمال یا اعضاری تبدیل کنیم کافی هستش که به شیوه زیر عمل کنیم

2 ^ 0 * (1) + 2 ^ 1 * (1) + 2 ^ 2 * (0) + 2 ^ 3 * (0) + 2 ^ 4 * (1)    =   25  

==================================================================================================================================

ASCII /  Unicode :   که برای متن ها میان و استفاده می شوند در واقع این  نوع استاندارد ها یک نوع پروتکل های جهانی هستند Encoding  هر دو تا استاندارد هایی هستند برای 
که میتوانند باعث ارتباط زبان های مختلف باهم باشند

Unicode : یکی از استاندارد های معروف اون هستش  UTF-8  یک استاندارد برنامه نویسی برای سازگاری و ارتباط بهتر زبان های مختلف باهم دیگه هستش  که 

تفاوت های اسکی و یونیکد

تعداد کاراکتر بسیار زیادی را پشتیبانی می کند Unicode اجازه استفاده از 128 کاراکتر را می دهد اما   ASCII 

است  UTF-8 در حال جایگزین شدن با ASCII دارند اما WWW  بیشترین استفاده را در پروتکل UTF-8 و ASCII 

با ترتیب حروف الفبایی است ASCII ترتیب کدگذاری 

بر اساس اعداد منحصر به فرد است Unicode  ترتیب کدگذاری

کاراکترهای زبان انگلیسی مورد استفاده قرار می گیرد Encoding  بیشتر برای  ASCII 

تقریبا همه کاراکترهای زبان های مختلف مورد استفاده قرار می گیرد Encoding برای  Unicode 

برای نمایش از ساختار 8 ، 16 و 32 بیتی استفاده می کند Unicode 

برای نمایش از ساختار و فرمول 7 بیتی استفاده می کند ASCII 

در نمایش صفحات وب است ASCII و Unicode در نهایت بیشترین تفاوت

==================================================================================================================================

وقتی یک ایموجی دریافت می کنیم، کامپیوتر ما در واقع فقط یک عدد را به صورت باینری دریافت می کند که سپس بر اساس استاندارد یونیکد به تصویر ایموجی نگاشت می شود

که سه تا بایت رو دریافت میکنه و رنگ رو نشون میده و با استفاده از این استاندارد RGB  ما با استفاده از بیت ها میتونیم بیایم و رنگ هارو نمایش بدیم مثل استفاده از استاندارد 
میتونیم بیایم و پیکسل هارو هم نمایش بدیم

MIDI همچنین ما میتوانیم موسیقی و یا صوت هارو هم با استفاده از بیت ها نمایش بدیم با استفاده از استاندارد 

==================================================================================================================================

Algorithm : 

The algorithm is a step by steps instructions given to a computer to perform a specific task, you can think of it as a process followed in making food recipes
we follow particular instructions or steps to make the food ready to eat, likewise, Algorithm is a step-based process for a computer to complete a task
الگوریتم یک دستورالعمل گام به گام است که برای انجام یک کار خاص به رایانه داده می شود، شما می توانید آن را به عنوان فرآیندی در نظر بگیرید که در دستور پخت غذا دنبال می شود، ما
دستورالعمل ها یا مراحل خاصی را برای آماده کردن غذا دنبال می کنیم، به همین ترتیب، الگوریتم یک فرآیند مبتنی بر مرحله برای رایانه برای تکمیل یک کار

Pseudocode :

Pseudocode is an informal syntax that is just a more specific version of English (or other human language) that represents our algorithm.
شبه کد یک نحو غیر رسمی است که فقط یک نسخه خاص تر از انگلیسی  ( یا دیگر زبان های انسانی ) است که الگوریتم ما را نشان می دهد


==================================================================================================================================
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
