/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

extract - 1

#include <stdio.h>

int main(void)
{
    char c1 = 'H';
    char c2 = 'I';
    char c3 = '!';

    printf("%i %i %i\n", (int)c1, (int)c2, (int)c3);
}

ما با تغیر دادن نوع میتونیم ببینیم که اون عدد اسکی که اون کاراکتره داره چی هستش طبق مثال بلا

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

extract - 2

#include <cs50.h>
#include <stdio.h>

int main(void)
{
    string s = "Hi!";
    printf("%i %i %i %i\n", s[0], s[1], s[2], s[3]);
}

\n  در حافظه به عنوان  یک کاراکتر


--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

extract - 3   برای فهمیدن طول یک رشته میتونیم بیایم با استقاده از نکته های بالا این تابع رو بنویسم

#include <cs50.h>
#include <stdio.h>

int string_length(string s);

int main(void)
{
    string name = get_string("Name: ");
    int length = string_length(name);
    printf("%i\n", length);
}

int string_length(string s)
{
    int i = 0;
    while (s[i] != '\0')
    {
        i++;
    }
    return i;
}

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

extract - 4 ما اگر بخایم بیایم و  نگاهی به اسکی مب بکنیم می بینیم که هر حروف با نوع کوچ با حروف نوع بزرگ اش  ۳۲ شماره فاصله داره که میتونیم بیایم و با استفاده از اون بیاده سازی بکنیم

#include <cs50.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>

int main(void)
{
    string s = get_string("Before: ");
    printf("After:  ");
    for (int i = 0, n = strlen(s); i < n; i++)
    {
        if (islower(s[i]))
        {
            printf("%c", s[i] - 32);
        }
        else
        {
            printf("%c", s[i]);
        }
    }
    printf("\n");
}

#include <cs50.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>

int main(void)
{
    string s = get_string("Before: ");
    printf("After:  ");
    for (int i = 0, n = strlen(s); i < n; i++)
    {
        printf("%c", toupper(s[i]));
    }
    printf("\n");
}

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

extract - 4

#include <cs50.h>
#include <stdio.h>

int main(int argc, string argv[])
{
    if (argc == 2)
    {
        printf("hello, %s\n", argv[1]);
    }
    else
    {
        printf("hello , world \n");
    }
}

بیایم و آرگومننت بدیم c ما با استفاده از تیکه کد بالا میتونیم بیایم و به 

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
