/*
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Data structure is a method or tool for data management and programming languages have a series 
of specific structures for data management , such as arrays objects, maps, and sets.

Built in JS Data Structure : Array  -  Sets  -  Map   -  Object

Linked List :   داریم و هر مقدار یک پوینتر داره که میاد و به مقدار بعدی برای ما اشاره میکنهindex ذخیره سازی مقادیر که خیلی شبیه به آرایه هستش و به جای 

المنت ها به خط بعدی اشاره میکنند و انتخاب منطقی تر برای ورود داده ها است و تاثیر بهتری برای بهبود پرفورمنس برای ما دارد
 
زمانی که قراره بیایم و یک ساختمان داده کاستوم بسازیم قرار نیستش که یک فانکشن باشه چون فانکشن یا توابع یک فرایند رو برای ما ایجاد میکنند و باید یک کلاس باشند

گفته می شود در قدم دوم نیاز به یک تابع داریم تا این لیست هارو بتونه برامون tail و دومی هم که به اون head  در داخل لینکد لیست ها ما دو تا المنت مهم داریم یکی اولی
append  بسازه که بر اساس یک مقداری یک المانی برامون بسازه به نام

یکی از فرایند های خیلی مهم در کار کردن با لینکد لیست ها  این هستش که بتونیم بیایم و یک المنتی رو پاک بکنیم برای همنی میایم و یک متد رو درست میکنیم با نام
رو اگر نداشت یعنی خالیه head در وهله اول میایم و چک میکنیم لیست امون خالی هستش یا نه و برای اون نگاه میکنیم اگر مقدار  delete
برای انجام فرایند دلیت فقط کافی است بیایم و اون پوینتر هارو پاک بکنیم

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
