/*
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
============================================================================================================================================

هستش در داخل جاوااسکریپت  مفهوم اشیا یا آبجکت ها دقیقا Hash Tabel  یکی از مهترین ساختمان داده هایی که داده هامون رو میان و بر اساس جدول داده هامون رو بررسی میکنند 
شده برای همین زمانی که از جی اس استفاده میکنیم وقتی نیاز به این مورد داریم دقیقا لازم هستش که از آبجکت ها استفاده بکنیم optimize ساخته شده البته خیلی   Hash Tabel براساس  

Object  و HashTabel  تفاوت های اصلی 

1 - Object :  key  ,  value
 
2-  HashTabel : index(number)  ,  value

Hashing Function  خوب حالا ما برای تبدیل کلید هامون به ایندکس باید بیایم و از یک فرایند استفاده بکنیم به نام

سوال به ما یک رشته دادن میگن بیاین و اولین مقداری که توش دوبار تکرار شده پیدا کن بده

let message = "Hello World"

function findFristChar(str) {
    for (let i = 0; i < str.length; i++) {
        for (let j = i + 0; j < str.length; j++) {
            if (str[i] === str[j]) {
                return str[i];
            }
        }
    }
}

console.log(findFristChar(message));


// میتونیم بریم HashTabel خوب این راه حلی هستش که ما با استفاده از 

let message = "Hello World";

function findFristChar(str) {
    const tabel = {};
    for (char of str) {
        console.log(tabel[char]);
        if (tabel[char]) {
            return char;
        }
        tabel[char] = 1;
    }
}

console.log(findFristChar(message));

============================================================================================================================================
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
*/
